---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.OvalFramingHeight
source: html/a4e04f16-092d-5588-7322-e15c226aa5c7.htm
---
# Autodesk.Revit.DB.ParameterTypeId.OvalFramingHeight Property

"Oval Height"

## Syntax (C#)
```csharp
public static ForgeTypeId OvalFramingHeight { get; }
```